# Написать 4 функции для мат. операций + - / *
# с параметрами a, b 

#
def sum(a, b):
    return a + b

def umnozh(a, b):
    return a * b


a = int(input())
b = int(input())
print(sum(a, b))
print(umnozh(a, b))
#